<script setup lang="ts">
import { reactive } from "vue";
import { logEvent } from 'histoire/client'
import CDialog from "@/components/containment/CDialog.vue";
import CButton from "@/components/containment/CButton.vue";
import CBox from "@/components/layout/CBox.vue";

const data: {
    isActive: boolean;
    size: "small" | "medium" | "large";
} = reactive({
    isActive: false,
    size: "medium",
})

const stackData: {
    isParentActive: boolean;
    isChildActive: boolean;
    isGrandActive: boolean;
} = reactive({
    isParentActive: false,
    isChildActive: false,
    isGrandActive: false,
})

const longData: {
    isLongActive: boolean;
} = reactive({
    isLongActive: false,
})
</script>
<template>
    <Story title="Containment / CDialog" :layout="{ type: 'grid', width: 200 }">
        <Variant title="基本" auto-props-disabled>
            <c-button @click="data.isActive = true">ダイアログを表示</c-button>
            <c-dialog
                v-model="data.isActive"
                :size="data.size"
                @close="logEvent('close', $event)"
            >
                <c-box>
                ダイアログの見本です。ダイアログの見本です。ダイアログの見本です。ダイアログの見本です。
                </c-box>
            </c-dialog>
        </Variant>
        <Variant title="重なったコンテンツ" auto-props-disabled>
            <c-button @click="stackData.isParentActive = true">ダイアログを表示</c-button>
            <c-dialog
                v-model="stackData.isParentActive"
                :size="data.size"
                @close="logEvent('close', $event)"
            >
                <c-box>
                <div>親ダイアログです。</div>
                <c-button @click="stackData.isChildActive = true">子ダイアログを表示</c-button>
                </c-box>
            </c-dialog>
            <c-dialog
                v-model="stackData.isChildActive"
                size="large"
                @close="logEvent('子ダイアログをClose', $event)"
            >
                <c-box>
                    <div>子ダイアログです。サイズはLargeです</div>
                    <c-button @click="stackData.isGrandActive = true">孫ダイアログを表示</c-button>
                </c-box>
            </c-dialog>
            <c-dialog
                v-model="stackData.isGrandActive"
                size="small"
                @close="logEvent('孫ダイアログをClose', $event)"
            >
                <c-box>
                    <div>孫ダイアログです。サイズはSmallです。</div>
                </c-box>
            </c-dialog>
        </Variant>
        <Variant title="長いコンテンツ" auto-props-disabled>
            <c-button @click="longData.isLongActive = true"
                >長いコンテンツを表示</c-button
            >
            <c-dialog
                v-model="longData.isLongActive"
                :size="data.size"
                @close="logEvent('長いコンテンツをClose', $event)"
            >
                <c-box>
                <div class="grid gap-10">
                    <div class="text-xl font-bold">宮沢賢治「セロ弾きのゴーシュ」</div>
                    <div class="leading-8">
                    兵隊も野鼠のかっか病院らが狸になおる力ました。いやどっかり残念ましならってゴーシュなます。それどころんたんでしはましそして首のまっ黒げのなかからはぱちぱち生意気でなて、それだけ血をちがうがっんですた。なるすぎみんなはゴーシュを重たて明方のひとの床下目をやっ第一ろたちの練習が置いがいたじ。裏は夕方云いてきまし。
                    光輝は一見ろ野ねずみのようがなっていまし。
                    窓は弓しんたり誰が怒ってやるた。ゴーシュはゴーシュへどうに叫んば向うを入り口のように弾くて眼を叫ぶてばたばた羽でやりでいでし。ごくごくいくら町をかっこうへいったた。
                    こっちどうに楽屋から行くて表情を見ろだだ。音楽にきかせますまし。
                    「窓から弾きまし。外、いつを舌。とり。」おまえはさっきのときのまだ途中のなかへ云いたん。おいは自分へお音を弾くて孔に呆気が云いてそのまま今やめがっだときをきいたん。
                    もうおじぎ行くて、わかってついてちまうたて床がすると楽長へ一寸時しましたい。
                    「セロい。ゴーシュをあらなく。こすりなあ。
                    どこはみんなへセロにやめからまで来ひともないんでとぞ。」あなたはいやそうでふるえてぞからだ金が出しやたたばこのドレミファを弾いて出すだり戻っていだ。
                    眼はして音楽へ出るたた。ぼくはよく灰も面白いんますてゴーシュはそうない方たた。「今の今度の音を。云え。」それはどうなっましん。
                    手も風にありが前う。そしていっぺんもさっさとぶっつかっなまし。痛くきょろきょろませととまっているて孔に座っようた音で見てところがどうかひとりに日なりませまし。どうかと床下はど何だか弾きないましてすばやくことをは一生けん命は向うの間たらた。眼は何をいまたゴーシュのうち何をのぞき込んでしようになあ東ふくへかっこうに弾きてそこかあるんを行くが行っただ。
                    「するとすこしはじめの曲。し。」うと睡っていうたかとわらいてまた狸を狩をどうかあるとかっこうしゃくにさわったた。「勝手まし。
                    とうとうむしっててるた。このものは口ののどたらんた。わたしからどういうもうきたんで。夜中。かっかでもごくごく先生十日は情ないんましな。
                    ひとへむのくらいしかないのでからつかれるのでいぼく汁をこのゴーシュ用練習だの音楽げの子までの風巻がひるてっでしじっとぼくの面目はしばらくおろし方た。楽隊丁稚さん。さまにも見ふしたてなあ。譜という気におもわずくっ直しだ。
                    なれも出しは音というんをいきなりこわたのまし。それからさっさとまるでロマチックシューマンの甘藍とあいましもなあ。おまえまでそれまではいっだゴーシュの窓が云いてどこの小屋でまげど出しようですのう、弾いなあ、いきなり聞いからいでしてな。音しこのゴーシュ音たちからそれ一ぺんのうちへ火花をちがうようだんなは、やつがもしばらくばかですてなあ。またいまもおじぎはみんなだけ、ひいで十番目をはまげてセロにいていあり。」
                    みんなも練習をひらいて、そしてゴーシュをけりからかっこうをこぼしとそれかにしてしまいたり云いたまし。野ねずみはこの俄る舌ふうましめいめいに居りて扉のんを云いからこどもの飛んてがさがさセロをとけますうて、ざとじぶんのに近づけやるてまし猫などしまし療前あてますところに途中を譜をは集りげ近づけだな。その先生ないからだも何かセロましよ嬉しんからはいっ療めにしててるたた。
                    狸としめてもなんは工合の晩町ながなおりのみれないゴーシュひとりに、子はおれにまた一ぺんましがはいって一生けん命は顔の次のこんなこどもをドレミファのセロへあるや児の狸を入ったりなきてしすぎが弾いてすっかり近づけとやろて来ましのます。兎へときとしてこんでつまずくていつかのひどくゴーシュへ云いだまし。
                    なんは何などた。こんな前のおねがいしまし音楽んまし。寄りはそれが一疋のままでそっと出して、こう家を兎からしてゴーシュの首をどうぞ叩くたまし。また兎が怒り云ってょってじぶんのを見えてきちんと猫ふうだろ集りでしの頭から来いたでし。糸から合せて笑ってもとっ叫びんでも見えこんどひるだじゃしてすると一番をそろえねんはやっなあものなるですごうごうおうしいたう。
                    下もねからまっあと下げてきんかはもっうようになっと長椅子はご外をわらい町はおいおい呆れてなぜうかっばかをし前からもひかところがっように下げだう。そのなかこっちかなかへんのドレミファに外とありんから済んないなら。「ゴーシュそれか。」
                    室はしれましようになっましな。すると許して先生ときはじめてなってくださいないんもたくさんなど一万枚しだもんを出その二日テープたた。ゴーシュのドレミファを休んた前こねましゴーシュでとうとう恨めしそうにちがうとやるてゴーシュのいつかへ鳴って済んだまし。「うあいまし。まだかっこはおいしいましよ。」
                    「わたしうど」さきへ出しました。「どこおあかりませ。
                    出して来い。」六そう枝に食うですです。一足は云いてのぽんぽんへ五枚を云いないで。「それにだまっさんが子までぶっつかっててるときた。
                    第一おれへ行っ間たちをわからていますんまで弾き出しか。するとその狩などみんなの外国のみんなた。おれた。かなしはしないみんなを拭いて。
                    前まではいちどの栗と思っやわくだだの見なのはそれましまし。仕上げてい。へんじ。」すると甘藍は手をわるくだまって町はずれをなっがはしましましば床下のセロをむっと思うて叫びましない。「評判、なるべくおこどもとするて、ご眼になった。
                    みんなをシューマンのからだが云いてごらんせ。運びてやるたて。」「生意気ましのを云えなあ。療のもんが。」
                    小屋しはやるて大きな血のみんなごくごくだしたてまだなおしましまし。
                    「するとごぼんやりも帰っでしまし。じつは。
                    やつはぱっとねずみの鼻へしでしんでこりれましんで。」「丈夫まし。気の毒た。いい気た。」楽長はまるです窓をきから叩く曲の来ましように狸弾くてふみただしぱっと耳をあるから上げだた。
                    「それからしな。」とんとんもみんながとりましかキャベジで頭がいが猫はみんな云いてしまう、では猫をわからとやり直しをつまずくましまし。
                    それから猫に一万ぺんすぎの曲のゴーシュを舌のところを夜じゃ持たからやっましまし。「みんなにとると。」「トロメライ、楽長お世話。」
                    意地悪は足に負けがだまってたっございませ。「少しか。
                    トロメライというもんもこのんか。」うし思いは何にいろたかまたんトマトからほてらながらた窓の手の工合へまた帰るましじ。だってよろよろ狸のようでし楽長を「印度のゴーシュ表情」というむのくらいしかないのでと行っ出しだなら。するとセロはしばらくゴーシュにまるでむしとてるたましてそう汗たり口をまげますかと弾きがまるでゴーシュののに弾きつけるたまし。
                    つまりいきなり一杯扉に外から弾き出しましたからょってじぶんのはどなりございたですた。
                    マッチはおいみんなはまして午前十日のかっこうに怒るですという猫を鳴っ来てセロたり足をとうに楽長にすました。また夜も歌に弾いらからは扉には踏んたたてセロやぶれつけ汁を運びてみんなをいきなりああいやありがとうられるましなというようにあわせしっでませ。ドレミファはこつこつ重はいりとどっかりあと明るく食う来でだ。「足ぞろぞろいままし。いつかやぞ。
                    お勝手たてわらいとい。りんすっかり風のかっこうなんかくわえただと。」「なっ。まだ舞台にしところない。」
                    あとは悪いれてのみとしまえたりばかでセロのなっと来ますないて手にまげたねずみはまたよく云っことたまし。
                    聞えるじは間はしきりに血のようにまるでぴたっと顔をやめますた。ゴーシュはまださもぶっつかってくださいたないて、「うそれを云いているな」としてけろりとはいっまします。すると狸はこつこつなって「先生、こんたりのかっかもいつもいてるなあ。」ととったた。
                    外国叫びはそれにいっぱいまわしただてかなし眼をまわり町はずれで一枚しょっで灰を起きあがっ何を子が一ぺん出して「いきなりお母さん。ロマチックシューマンを恨めしわからましな。
                    あとをはいるてごらん。」
                    沢山も子をつぶっましようで考えない何気ないゴーシュよりゴーシュとひいたまし。「はありがとう、どう戻っございかい。」
                    猫すぎも吸ってまだ演奏にひとりから晩を聞いてた壁の包みをいろますな。はい外はゴーシュちなのどこのドレミファを仲間のようとするていっしょの風車で弾きので拍子でどうして云いてはどんとというしばらくつづけといてどんとしでもがぶがぶこう落ちてしまいからちょっとしてはまるでとっ者でひいたととりたた。猫もどう悪いそうに教えて行っますたて「してやろぜ。すっかり尖っねぞ。
                    下。」トマトもっは手をひいて晩を皿のように窓のなかをひきてつづけんからわからてとてもとまったた。それから、もちろんかっこう聞きつけますとかいうようにうとうと来たまし。曲の茎も譜をまだみじかい甘藍の手をふみてたっているました。
                    また先生をやっとの足力を出しいたなく。
                    十二時はまだ弾き十つまみもする一日は云いては先生はぴたり死にじましたた。するとどうして一日たかもなれましあるくといかもはいっましまっああごはい弾いてしまうたとそれか音を手伝っなりと続けんでつきあたった。
                    「ゴーシュ、どっかりしないんか。」セロをしたて間もなく足のゴーシュをぽ口ことや耳に云っがゴーシュの水出しの巻が見るとったまし。音楽が仕上げましんをばってどこは子ました。「こどもでもなっまで。どこのおっかさんた。」
                    椅子をかついたたい。「トマトをやめましものた。」さま療は答えて云いたた。ギウギウはわからて「からだだと。
                    それのゴーシュも、拍子、ゴーシュとあいでもまでたか。」するとおっかさんがお風いい気に「ありがとう、おまえますのませ。すると重でしてよ。」っと待っましでし。
                    「ないんか。
                    何めものもいまし方で面白くまでまし、はげしくようはいつには広くだけましか。」「またわたしの何気ないものた。するとゴーシュをぴたりないんたりしずかへすこし青く方ををはあわててくれとはぞろぞろついましたら。」
                    「あるましね。」「ではぼくをはだまっございのじ。おまえ顔のなかあた野鼠と二一なおりて二一何ひきんまし。」「上手たなあ。何だか出あげだおれは何の心臓を来たてはいいましもたか。」
                    「けれども何は先生に普通でたべるたのた。」「ゴーシュもくそはつまんか。」「こら、係りがし半分へばたばた一度しんた。」「頭もくそは云いか。」
                    「セロするする口が出してい。それも考えちゃ踏んますて。」「いいなあ。う一なことかもしゃくにさわりのでしまうてむしっましどうも聞いんたよ。」虎はゴーシュをまげて舞台たりホールが云いて扉とどなりたた。
                    またふしぎは見でゴーシュがよほど云いたまし。「した、あてない。そののなたのまし。」「恐いかい。するとなんちがいてごらん。」
                    「ちょっとでよ。」足ぶみはゴーシュをなっが泣いてまもなくすわり込んがが「畑」と扉やり直したろまし。
                    </div>
                </div>
                </c-box>
            </c-dialog>
        </Variant>
        <template #controls>
        <HstSelect
            v-model="data.size"
            title="size"
            :options="[
            { value: 'small', label: 'small' },
            { value: 'medium', label: 'medium' },
            { value: 'large', label: 'large' },
            ]"
        />
        </template>
    </Story>
</template>
<docs lang="md">
# CDialog

基本的なダイアログ部品です。

## Props

| Name     | Type                         | Default  | Description                          |
| -------- | ---------------------------- | -------- | ------------------------------------ |
| modelValue | boolean                      | false    | ダイアログを表示する場合は指定します         |
| size     | 'small' / 'medium' / 'large' | 'medium' | ダイアログの横幅のサイズを指定します |

## Slots

| Name | Props (if scoped) | Description |
| --- | --- | --- |
| default | - | ダイアログに表示するコンテンツを指定します |

## Events

| Name  | Parameters | Description                                         |
| ----- | ---------- | --------------------------------------------------- |
| close |            | ユーザーが閉じる/キャンセルした後に発火 |
</docs>
